app/views/posts/_form.html.erb


  <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |chkbx| %>
---
SELECT "categories".* FROM "categories"