app/controllers/categories_controller.rb

  def create
    @category = Category.new(params.require(:category).permit(:name))

    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "slug", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 23 Mar 2015 05:09:14 UTC +00:00], ["name", "Entertainment"], ["slug", "entertainment"], ["updated_at", Mon, 23 Mar 2015 05:09:14 UTC +00:00]]