app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'testing-the-slash' LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "are you kidding?"], ["created_at", Tue, 17 Mar 2015 19:17:44 UTC +00:00], ["post_id", 2], ["updated_at", Tue, 17 Mar 2015 19:17:44 UTC +00:00], ["user_id", 1]]
---
  def create
    @post = Post.find_by(slug: params[:post_id])
    @comment = @post.comments.build(comment_params)

    if current_user?
      @comment.creator = current_user

      # only allow comments if the user is signed in
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "votable_id", "votable_type", "vote") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 22 Mar 2015 16:40:11 UTC +00:00], ["updated_at", Sun, 22 Mar 2015 16:40:11 UTC +00:00], ["user_id", 11], ["votable_id", 3], ["votable_type", "Comment"], ["vote", false]]
---
  def vote
    @comment = Comment.find(params[:id])
    vote = @comment.votes.new(creator: current_user, vote: params[:vote])

    respond_to do |format|

      format.html do
        if current_user?
          # -------------------- Only run this block if user is logged in
          if vote.save