app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)
    @comment.creator = User.first
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1