app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if current_user?
      @post.creator = current_user

      # only allow posts if the user is signed in
      if @post.save
---
INSERT INTO "posts" ("created_at", "description", "slug", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 4  [["description", "something"], ["updated_at", Mon, 09 Mar 2015 01:00:56 UTC +00:00]]

  def vote
    vote = @post.votes.new(creator: current_user, vote: params[:vote])

    respond_to do |format|

      format.html do
        if current_user?
          # -------------------- Only run this block if user is logged in
          if vote.save
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "votable_id", "votable_type", "vote") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 22 Mar 2015 04:54:24 UTC +00:00], ["updated_at", Sun, 22 Mar 2015 04:54:24 UTC +00:00], ["user_id", 11], ["votable_id", 1], ["votable_type", "Post"], ["vote", true]]