app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "role", "slug", "time_zone", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "11"]]

  def update
    if User.find(current_user.id).update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "users" SET "username" = ?, "slug" = ?, "updated_at" = ? WHERE "users"."id" = 12  [["username", "bobby2"], ["slug", "bobby2"], ["updated_at", Mon, 23 Mar 2015 05:01:41 UTC +00:00]]