app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'newuser' LIMIT 1
---
  def create
    @user = User.new(user_params)

    if @user.save
      flash[:notice] = "#{params[:user][:username]} was successfully registered!"
      session[:user_id] = User.find_by_username(params[:user][:username]).id